Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)
Sets the MainViewport of a standard RhinoView to a named views settings
index:
view:
backgroundBitmap:
Returns: