Rhino.Display.DisplayPipeline.DrawBitmap(Rhino.Display.DisplayBitmap,System.Int32,System.Int32,System.Drawing.Color)
Draws a bitmap in screen coordinates
bitmap: bitmap to draw
left: where top/left corner of bitmap should appear in screen coordinates
top: where top/left corner of bitmap should appear in screen coordinates
maskColor: mask color to apply to bitmap for transparent regions