Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and two vectors in the plane.
origin: Origin point of the plane.
xDirection:
Non-zero vector in the plane that determines the x-axis direction.
yDirection:
Non-zero vector not parallel to x_dir that is used to determine the
yaxis direction. y_dir does not need to be perpendicular to x_dir.

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a plane from three non-colinear points.
origin: Origin point of the plane.
xPoint:
Second point in the plane. The x-axis will be parallel to x_point-origin.
yPoint:
Third point on the plane that is not colinear with the first two points.
yaxis*(y_point-origin) will be > 0.