Rhino.UI.LOC.STR(System.String)
Strings that need to be localized should call this function. The STR function doesn't actually
do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.STR. The function is then replaced with a
call to Localization.LocalizeString using a unique context ID.
english: [in] The English string to localize.

Rhino.UI.LOC.COMMANDNAME(System.String)
Command names that need to be localized should call this function. The COMMANDNAME function doesn't actually
do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COMMANDNAME and builds a record for each command
name for the translators that can be used by developers in a commands overridden Rhino.Commands.Command.LocalName
which should call Rhino.UI.Localization.LocalizeCommandName(EnglishName)
english: [in] The English string to localize.

Rhino.UI.LOC.CON(System.String)
Command option name strings that need to be localized should call this function. The CON function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.CON. The function is then replaced with a
call to Localization.LocalizeCommandOptionName using a unique context ID.
english: [in] The English string to localize.
Returns: Returns localized string pair with both the English and local names set to the English value.

Rhino.UI.LOC.CON(System.String,System.Object)
Command option name strings that need to be localized should call this function. The CON function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.CON. The function is then replaced with a
call to Localization.LocalizeCommandOptionName using a unique context ID.
english: [in] The English string to localize.
assemblyFromObject: [in] The object that identifies the assembly that owns the command option name.
Returns: Returns localized string pair with both the English and local names set to the English value.

Rhino.UI.LOC.COV(System.String)
Command option name strings that need to be localized should call this function. The COV function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COV. The function is then replaced with a
call to Localization.LocalizeCommandOptionValue using a unique context ID.
engilsh: [in] The English string to localize.
Returns: Returns localized string pair with both the English and local names set to the English value.

Rhino.UI.LOC.COV(System.String,System.Object)
Command option name strings that need to be localized should call this function. The COV function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COV. The function is then replaced with a
call to Localization.LocalizeCommandOptionValue using a unique context ID.
engilsh: [in] The English string to localize.
assemblyFromObject: [in] The object that identifies the assembly that owns the command option value.
Returns: Returns localized string pair with both the English and local names set to the English value.