Rhino.PlugIns.PlugIn.GetLicense(Rhino.PlugIns.LicenseBuildType,Rhino.PlugIns.ValidateProductKeyDelegate)
Verifies that there is a valid product license for your plug-in, using
the Rhino licensing system. If the plug-in is installed as a standalone
node, the locally installed license will be validated. If the plug-in
is installed as a network node, a loaner license will be requested by
the system's assigned Zoo server. If the Zoo server finds and returns
a license, then this license will be validated. If no license is found,
then the user will be prompted to provide a license key, which will be
validated.
productBuildType:
The product build contentType required by your plug-in.
validateDelegate:
Since the Rhino licensing system knows nothing about your product license,
you will need to validate the product license provided by the Rhino
licensing system. This is done by supplying a callback function, or delegate,
that can be called to perform the validation.
Returns:
true if a valid license was found. false otherwise.

Rhino.PlugIns.PlugIn.GetLicense(Rhino.PlugIns.LicenseCapabilities,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
Verifies that there is a valid product license for your plug-in, using
the Rhino licensing system. If the plug-in is installed as a standalone
node, the locally installed license will be validated. If the plug-in
is installed as a network node, a loaner license will be requested by
the system's assigned Zoo server. If the Zoo server finds and returns
a license, then this license will be validated. If no license is found,
then the user will be prompted to provide a license key, which will be
validated.
licenseCapabilities:
In the event that a license was not found, or if the user wants to change
the way your plug-in is licenses, then provide what capabilities your
license has by using this enumeration flag.
textMask:
In the event that the user needs to be asked for a license, then you can
provide a text mask, which helps the user to distinguish between proper
and improper user input of your license code. Note, if you do not want
to use a text mask, then pass in a null value for this parameter.
For more information on text masks, search MSDN for the System.Windows.Forms.MaskedTextBox class.
validateDelegate:
Since the Rhino licensing system knows nothing about your product license,
you will need to validate the product license provided by the Rhino
licensing system. This is done by supplying a callback function, or delegate,
that can be called to perform the validation.
Returns:
true if a valid license was found. false otherwise.

Rhino.PlugIns.PlugIn.PlugInRuiDictionary
Toolbars uses reflection to access this method, do NOT remove or rename it
without updating the references in the Toolbars plug-in.  This is a hack for
Rhino 5 only, in V6 all of the toolbar related plug-in stuff has been moved
into the Toolbars plug-in.
Returns:

Rhino.PlugIns.PlugIn.ValidateRegisteredPlugInRuiFileNameHelper(System.IntPtr,System.IntPtr,System.Guid,System.IntPtr)
registeredRuiFile:
fullPathToPlugIn:
plugInId:
pResult:
Returns:
0 = no file name or do noting
1 = file name found and useable
2 = file name modified, update the registered file name