Rhino.DocObjects.Tables.InstanceDefinitionTable.MakeSourcePathRelative(Rhino.DocObjects.InstanceDefinition,System.Boolean,System.Boolean)
Marks the source path for a linked instance definition as relative or absolute.
idef: The instance definition to be marked.
relative:
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
true if the instance definition could be modified.