Rhino.UI.IStackedDialogPageService
For internal use, the IStackedDialogPageService service is implemented in
RhinoWindows or RhinoMac as appropriate and handles the communication
with core Rhino
This is borrowed from StackedDialogPageService.cs in Rhino 6.0 for Windows
and is only included in MacRhino 5.1, this does not appear in Rhino 5 for
Windows.  Only hooking up here to get ObjectProperties selection support on
Mac Rhino.