Rhino.Runtime.LicenseManager.ValidatorHelper.#ctor(System.IntPtr,System.Guid,System.String,System.String)
Constructor
validator: CRhinoLicenseValidator unmanaged pointer
id: License type Id
title: License title
path: Full path to the executable requesting the license

Rhino.Runtime.LicenseManager.ValidatorHelper.Path
This method is called by the Zoo Client using reflection so there are
no direct calls to it here.  The Zoo Client will fail if this method
is not defined.
Returns:

Rhino.Runtime.LicenseManager.ValidatorHelper.ProductId
This method is called by the Zoo Client using reflection so there are
no direct calls to it here.  The Zoo Client will fail if this method
is not defined.
Returns:

Rhino.Runtime.LicenseManager.ValidatorHelper.ProductTitle
This method is called by the Zoo Client using reflection so there are
no direct calls to it here.  The Zoo Client will fail if this method
is not defined.
Returns:

Rhino.Runtime.LicenseManager.ValidatorHelper._path
Full path to the executable requesting the license.