Rhino.RhinoDoc.GetGumballPlane(Rhino.Geometry.Plane@)
Returns the active plane of Rhino's auto-gumball widget.
Note, when calling from a Rhino command, make sure the command
class has the Rhino.Commands.Style.Transparent command style attribute.
z
plane: The active plane.
Returns: true if the auto-gumball widget is enabled and visible. False otherwise.

Rhino.RhinoDoc.ExtractPreviewImage(System.String)
Extracts the bitmap preview image from the specified model (3DM).
path:
The model (3DM) from which to extract the preview image.
If null, the currently loaded model is used.
Returns: true on success.