Rhino.ApplicationSettings.CommandAliasList.GetMacro(System.String)
Returns the macro of a command alias.
alias: [in] The name of the command alias.

Rhino.ApplicationSettings.CommandAliasList.SetMacro(System.String,System.String)
Modifies the macro of a command alias.
alias: [in] The name of the command alias.
macro: [in] The new command macro to run when the alias is executed.
Returns: true if successful.

Rhino.ApplicationSettings.CommandAliasList.Add(System.String,System.String)
Adds a new command alias to Rhino.
alias: [in] The name of the command alias.
macro: [in] The command macro to run when the alias is executed.
Returns: true if successful.

Rhino.ApplicationSettings.CommandAliasList.Delete(System.String)
Deletes an existing command alias from Rhino.
alias: [in] The name of the command alias.
Returns: true if successful.

Rhino.ApplicationSettings.CommandAliasList.IsAlias(System.String)
Verifies that a command alias exists in Rhino.
alias: [in] The name of the command alias.
Returns: true if the alias exists.