Rhino.FileIO.File3dm.Write(System.String,Rhino.FileIO.File3dmWriteOptions)
Writes contents of this model to an openNURBS archive. I STRONGLY
suggested that you call Polish() before calling Write so that your
file has all the "fluff" that makes it complete.  If the model is
not valid, then Write will refuse to write it.
path: The file name to use for writing.
options:
Returns:
true if archive is written with no error.
false if errors occur.

Rhino.FileIO.File3dm.IsValid(Rhino.FileIO.TextLog)
Checks a model to make sure it is valid.
errors:
if errors are found, a description of the problem is put in this variable.
Returns: true if the model is valid.

Rhino.FileIO.File3dm.InstanceDefinitions
Instance definitions in this file

Rhino.FileIO.File3dm.HistoryRecords
History records stored in this file