Rhino.Display.RhinoView.CreateWireframePreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
imagePath:
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
size: [in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
Returns: true if successful.

Rhino.Display.RhinoView.CreateShadedPreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
imagePath:
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (bmp, tga, jpg, pcx, png, tif).
size: [in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
useGhostedShading: true if ghosted shading (partially transparent shading) should be used.
Returns: true if successful.