Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType)
Extrude a curve to a taper making a brep (potentially more than 1)
curveToExtrude: the curve to extrude
distance: the distance to extrude
direction: the direction of the extrusion
basePoint: the basepoint of the extrusion
draftAngleRadians: angle of the extrusion
cornerType:
Returns: array of breps on success