Rhino.UI.Dialogs.ShowMessage(System.String,System.String)
Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
Returns: One of the ShowMessageBoxResult values.

Rhino.UI.Dialogs.ShowMessage(System.String,System.String,Rhino.UI.ShowMessageButton,Rhino.UI.ShowMessageIcon)
Same as System.Windows.Froms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
buttons: Which buttons to display in the message box.
icon: Which icon to display in the message box.
Returns: One of the ShowMessageBoxResult values.