Rhino.DocObjects.Tables.LayerTable.Purge(System.Int32,System.Boolean)
Delete layer and all geometry objects on a layer
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer.
Returns:
true if successful. false if layerIndex is out of range or the the layer cannot be
deleted because it is the current layer.