Rhino.RhinoApp.SendKeystrokes(System.String,System.Boolean)
Sends a string of printable characters, including spaces, to Rhino's command line.
characters: [in] A string to characters to send to the command line. This can be null.
appendReturn: [in] Append a return character to the end of the string.

Rhino.RhinoApp.ExecuteCommand(System.String)
Execute a Rhino command.
commandName: Name of command to run.  Use command's localized name or preface with an underscore.
Returns: Returns the reult of the command.

Rhino.RhinoApp.LicenseSavesLeft
Returns number of saves left in save-limited Evaluation. Zero when
evaluation is expired.
Raises InvalidLicenseTypeException if LicenseType != EvaluationSaveLimited