Rhino.Input.Custom.GetBaseClass.AddOptionEnumList``1(System.String,``0)
Add a choice of enum values as list option
The enum type
englishOptionName: The name of the option
defaultValue: The default value
Throws System.ArgumentException: Gets thrown if defaultValue provided is not an enum type.
Returns: Option index

Rhino.Input.Custom.GetBaseClass.AddOptionEnumSelectionList``1(System.String,System.Collections.Generic.IEnumerable{``0},System.Int32)
Add a list of enum values as option list. Use enumSelection[go.Option.CurrentListOptionIndex] to retrieve selection.
englishOptionName:
enumSelection:
listCurrentIndex:
Returns:

Rhino.Input.Custom.GetBaseClass.GetSelectedEnumValue``1
Returns the selected enum value. Use this in combination with Rhino.Input.Custom.GetBaseClass.AddOptionEnumList``1(System.String,``0)
Throws System.ArgumentException: Gets thrown if type T is not an enum type.
Throws System.IndexOutOfRangeException: If 0 >= CurrentListOptionIndex or CurrentListOptionIndex > N where N is the number of enum values.
Returns: