Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(System.Int32,System.Int32@)
Show Rhino or Beta expired message
mode:
result:
Returns:

Rhino.PlugIns.LicenseUtils.GetLicense(System.String,System.Guid,System.String,Rhino.PlugIns.LicenseCapabilities,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
20-May-2013 Dale Fugier
This (internal) version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino.PlugIns.PlugIn objects.

Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,System.Int32,System.String)
This version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino C++ plug-ins.

Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate)
This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense
is used by Rhino C++ plug-ins.