Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a curve blend between 2 curves at the parameters specified
with the directions and continuities specified
curve0: First curve to blend from
t0: Parameter on first curve for blend endpoint
reverse0:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity0: continuity for the blend at the start
curve1: Second curve to blend from
t1: Parameter on second curve for blend endpoint
reverse1:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity1: continuity for the blend at the end
Returns: the blend curve on success. null on failure