Rhino.Collections.ArchivableDictionary.Read(Rhino.FileIO.BinaryArchiveReader)
Reads a dictionary from an archive.
archive:
The archive to read from. The archive position should be at the beginning of
the dictionary
Returns: new filled dictionary on success. null on failure.