Rhino.Render.CachedTextureCoordinates.Add(Rhino.Geometry.Point3d)
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.
item:

Rhino.Render.CachedTextureCoordinates.Clear
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.

Rhino.Render.CachedTextureCoordinates.Remove(Rhino.Geometry.Point3d)
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.

Rhino.Render.CachedTextureCoordinates.Insert(System.Int32,Rhino.Geometry.Point3d)
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.
index:
item:

Rhino.Render.CachedTextureCoordinates.RemoveAt(System.Int32)
IList implementation, this list is always read-only so calling this
will cause a NotSupportedException to be thrown.
index: