Rhino.Geometry.Light.IsPointLight
Gets a value indicating whether the light style
is Rhino.Geometry.LightStyle CameraPoint or WorldPoint.

Rhino.Geometry.Light.IsDirectionalLight
Gets a value indicating whether the light style
is Rhino.Geometry.LightStyle CameraDirectional or WorldDirectional.

Rhino.Geometry.Light.IsSpotLight
Gets a value indicating whether the light style
is Rhino.Geometry.LightStyle CameraSpot or WorldSpot.

Rhino.Geometry.Light.IsLinearLight
Gets a value indicating whether the light style
is Rhino.Geometry.LightStyle WorldLinear.

Rhino.Geometry.Light.IsRectangularLight
Gets a value indicating whether the light style
is Rhino.Geometry.LightStyle WorldRectangular.