Rhino.Geometry.RadialDimension.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double)
Construct a radial dimension from 3d input
center: center of Circle
arrowTip: 3d point on the circle at the dimension arrow tip
xAxis: x axis of the dimension's plane
normal: normal to the dimension's plane
offsetDistance: distance from arrow tip to knee point

Rhino.Geometry.RadialDimension.#ctor(Rhino.Geometry.Circle,Rhino.Geometry.Point3d,System.Double)
Construct a radial dimension from 3d input
circle:
arrowTip: 3d point on the circle at the dimension arrow tip
offsetDistance: distance from arrow tip to knee point