Rhino.Runtime.HostUtils.GetPlatformService``1
For internal use only
Returns:

Rhino.Runtime.HostUtils.UnhandledThreadException(System.Object,System.Threading.ThreadExceptionEventArgs)
Exception handler for exceptions occuring on the UI thread
sender:
e: