Rhino.Runtime.InteropWrappers.StringHolder
This class is used to pass strings back and forth between managed
and unmanaged code.  This should not be be needed by plug-ins.

Rhino.Runtime.InteropWrappers.StringHolder.ToString
Marshal unmanaged ON_wString to a managed .NET string
Returns:

Rhino.Runtime.InteropWrappers.StringHolder.GetString(System.IntPtr)
Get managed string from unmanaged ON_wString pointer.
pStringHolder:
Returns: