Rhino.DocObjects.DimensionStyleArrowType.SolidTriangle
2:1

Rhino.DocObjects.DimensionStyleArrowType.Dot


Rhino.DocObjects.DimensionStyleArrowType.Tick


Rhino.DocObjects.DimensionStyleArrowType.ShortTriangle
1:1

Rhino.DocObjects.DimensionStyleArrowType.Arrow


Rhino.DocObjects.DimensionStyleArrowType.Rectangle


Rhino.DocObjects.DimensionStyleArrowType.LongTriangle
4:1

Rhino.DocObjects.DimensionStyleArrowType.LongerTriangle
6:1