Rhino.UI.StackedDialogPage.PageControl
Return the control that represents this page.
Currently only classes derived from System.Windows.Forms.Control are allowed

Rhino.UI.StackedDialogPage.PageImage
Opitionally override to provide a image to display in
the Mac Rhino UI
The page image.