Rhino.FileIO.File3dmHistoryRecordTable
Table of custom data provided by plug-ins

Rhino.FileIO.File3dmHistoryRecordTable.Dump
Prepares a text dump of table.
Returns: A string containing the dump.

Rhino.FileIO.File3dmHistoryRecordTable.Count
Gets the number of history records in this table.

Rhino.FileIO.File3dmHistoryRecordTable.Clear
Remove all entries from this table