Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)
Get a stored enum value using a custom key, or return default value if not found.
key:
defaultValue:
Returns:

Rhino.PersistentSettings.GetEnumValue``1
Get a stored enum value.
Returns:

Rhino.PersistentSettings.TryGetEnumValue``1(``0@)
Attempt to get the stored value for an enum setting. Note: the enum value ALWAYS gets assigned!
Be sure to check for success of this method to prevent erroneous use of the value.
enumValue:
Returns:

Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)
Set an enum value in the settings using a custom key
key:
enumValue: