Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Arc)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from another Rhino.Geometry.Arc.
arc: Another Arc.

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Arc,System.Double,System.Double)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from another Rhino.Geometry.Arc and specifying the
needed parametrization of the arc.
Arc will not be cut again at these parameterizations.
arc: An original arc.
t0: A new Domain.T0 value.
t1: A new Domain.T1 value.