Rhino.ApplicationSettings.FileSettings.AddSearchPath(System.String,System.Int32)
Adds a new imagePath to Rhino's search imagePath list.
See "Options Files settings" in the Rhino help file for more details.
folder: [in] The valid folder, or imagePath, to add.
index:
[in] A zero-based position index in the search imagePath list to insert the string.
If -1, the imagePath will be appended to the end of the list.
Returns:
The index where the item was inserted if success.
-1 on failure.

Rhino.ApplicationSettings.FileSettings.DeleteSearchPath(System.String)
Removes an existing imagePath from Rhino's search imagePath list.
See "Options Files settings" in the Rhino help file for more details.
folder: [in] The valid folder, or imagePath, to remove.
Returns: true or false indicating success or failure.

Rhino.ApplicationSettings.FileSettings.LocalProfileDataFolder
Get full path to a Rhino specific sub-folder under the per-user Local
(non-roaming) Profile folder.  This is the folder where user-specific
data is stored.
Windows NT4, 2000, XP, usually someplace like:
"C:\Documents and Settings\[USERNAME]\Local Settings\Application Data\McNeel\Rhinoceros\[VERSION_NUMBER]\"
Windows Vista, 7, usually someplace like:
"C:\Users\[USERNAME]\AppData\Local\McNeel\Rhinoceros\[VERSION_NUMBER]\"