Rhino.Geometry.Vector3f.op_Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two vectors together, returning the dot product (or inner product).
This differs from the cross product.
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.

Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two vectors together, returning the dot product (or inner product).
This differs from the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y + v1.Z*v2.Z.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.