Rhino.Geometry.Collections.NurbsCurveKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsCurveKnotList,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns: