Rhino.FileIO.File3dmInstanceDefinitionTable.Dump
Prepares a text dump of object table.
Returns: A string containing the dump.

Rhino.FileIO.File3dmInstanceDefinitionTable.GetEnumerator
Gets the enumerator that visits any Rhino.Geometry.InstanceDefinitionGeometry in this table.
Returns: The enumerator.